app/Controllers/Admin_controllers/Admin_controller.php

    public function admin()
    {
        // verificamos si el usuario es administrador
        $this->verificarAdmin();

        // estadisticas para el dashboard
        $data['titulo'] = 'Sección de Administrador';
        $data['total_usuarios'] = $this->usuarioModel->countAll();
        $data['usuarios_activos'] = $this->usuarioModel->where('is_active', 1)->countAllResults();
        $data['usuarios_inactivos'] = $this->usuarioModel->where('is_active', 0)->countAllResults();
        $data['total_admins'] = $this->usuarioModel->where('is_admin', 1)->countAllResults();
        $data['total_movies'] = $this->moviesModel->countAll();
        $data['total_series'] = $this->seriesModel->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `usuarios`
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_active` = 0
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_admin` = 1
SELECT COUNT(*) AS `numrows` FROM `series`


        // obtenemos los datos paginados
        $data['titulo'] = 'Gestión de Usuarios - Admin';
        $data['usuarios'] = $builder->orderBy('created_at', 'DESC')
            ->paginate($perPage, 'default', $page);
---
SELECT *
FROM `usuarios`
ORDER BY `created_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows` FROM `usuarios`


        // creamos las avariables y obtenemos las estadisticas para el dashboard de usuarios
        $data['total_usuarios'] = $this->usuarioModel->countAll();
        $data['usuarios_activos'] = $this->usuarioModel->where('is_active', 1)->countAllResults();
        $data['usuarios_inactivos'] = $this->usuarioModel->where('is_active', 0)->countAllResults();
        $data['total_admins'] = $this->usuarioModel->where('is_admin', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_active` = 0
SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_admin` = 1

    public function cambiarEstado($id)
    {
        $this->verificarAdmin();

        $usuario = $this->usuarioModel->find($id);

        if (!$usuario) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Usuario no encontrado.'
            ]);
        }

        // cambiamos el estado del usuario (activo/inactivo)
        $nuevoEstado = $usuario['is_active'] ? 0 : 1;

        // una vez actualizado el estado de un usuario, se crea el json correspondiente con la informacion
        if ($this->usuarioModel->update($id, ['is_active' => $nuevoEstado])) {
---
UPDATE `usuarios` SET `is_active` = 0, `updated_at` = '2025-06-29 19:08:22'
WHERE `usuarios`.`user_id` IN ('3')