app/Controllers/Admin_controllers/Movies_controller.php

    public function movie_detail($id = null)
    {
        $movie = $this->movieModel->find($id);

        $generos = $this->peliculaGeneroModel
            ->select('generos.nombre, generos.slug')
            ->join('generos', 'generos.genero_id = pelicula_generos.genero_id')
            ->where('pelicula_generos.movie_id', $id)
            ->findAll();
---
SELECT `generos`.`nombre`, `generos`.`slug`
FROM `pelicula_generos`
JOIN `generos` ON `generos`.`genero_id` = `pelicula_generos`.`genero_id`
WHERE `pelicula_generos`.`movie_id` = '10'