app/Controllers/Admin_controllers/Movies_controller.php

        $movieIds = array_column($movies, 'movie_id');
        $generoPorPelicula = [];
        if (!empty($movieIds)) {
            $generos = $this->peliculaGeneroModel
                ->select('pelicula_generos.movie_id, generos.nombre, generos.slug')
                ->join('generos', 'generos.genero_id = pelicula_generos.genero_id')
                ->whereIn('pelicula_generos.movie_id', $movieIds)
                ->findAll();
---
SELECT `pelicula_generos`.`movie_id`, `generos`.`nombre`, `generos`.`slug`
FROM `pelicula_generos`
JOIN `generos` ON `generos`.`genero_id` = `pelicula_generos`.`genero_id`
WHERE `pelicula_generos`.`movie_id` IN ('10','1','7','8','2','5','9','3','6','4')

    public function filtro_genero_pelicula($slug = 'todas')
    {
        $moviesPage = $this->request->getVar('movies_page') ?? 1;
        $moviesPerPage = 15;
        $movieFilter = $this->request->getVar('movies_filter') ?? 'title';
        $movieDirection = $this->request->getVar('movies_direction') ?? 'asc';
        $movieDirection = strtoupper($movieDirection) === 'DESC' ? 'DESC' : 'ASC';

        $moviesOrderBy = match ($movieFilter) {
            'title' => 'titulo',
            'release' => 'año',
            'rating' => 'valoracion',
            default => 'titulo'
        };

        // si el slug es 'todas', no filtramos por genero
        if ($slug === 'todas') {
            $movies = $this->movieModel
                ->select('movie_id, titulo, año, poster, valoracion, activa')
                ->orderBy($moviesOrderBy, $movieDirection)
                ->paginate($moviesPerPage, 'movies', $moviesPage);

            $moviesTotal = $this->movieModel->countAll();
        } else {
            // filtrar por genero usando join y el slug
            $movies = $this->movieModel
                ->select('peliculas.movie_id, peliculas.titulo, peliculas.año, peliculas.poster, peliculas.valoracion, peliculas.activa')
                ->join('pelicula_generos', 'peliculas.movie_id = pelicula_generos.movie_id')
                ->join('generos', 'generos.genero_id = pelicula_generos.genero_id')
                ->where('generos.slug', $slug)
                ->orderBy($moviesOrderBy, $movieDirection)
                ->paginate($moviesPerPage, 'movies', $moviesPage);

            // solo contamos las peliculas del genero filtrado
            // Solo contar las películas del género filtrado
            $moviesTotal = $this->movieModel
                ->join('pelicula_generos', 'peliculas.movie_id = pelicula_generos.movie_id')
                ->join('generos', 'generos.genero_id = pelicula_generos.genero_id')
                ->where('generos.slug', $slug)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `peliculas`
JOIN `pelicula_generos` ON `peliculas`.`movie_id` = `pelicula_generos`.`movie_id`
JOIN `generos` ON `generos`.`genero_id` = `pelicula_generos`.`genero_id`
WHERE `generos`.`slug` = 'accion'
SELECT `peliculas`.`movie_id`, `peliculas`.`titulo`, `peliculas`.`año`, `peliculas`.`poster`, `peliculas`.`valoracion`, `peliculas`.`activa`
FROM `peliculas`
JOIN `pelicula_generos` ON `peliculas`.`movie_id` = `pelicula_generos`.`movie_id`
JOIN `generos` ON `generos`.`genero_id` = `pelicula_generos`.`genero_id`
WHERE `generos`.`slug` = 'accion'
ORDER BY `titulo` ASC
 LIMIT 15

        $movieIds = array_column($movies, 'movie_id');
        $generoPormovie = [];
        if (!empty($movieIds)) {
            $generos = $this->peliculaGeneroModel
                ->select('pelicula_generos.movie_id, generos.nombre, generos.slug')
                ->join('generos', 'generos.genero_id = pelicula_generos.genero_id')
                ->whereIn('pelicula_generos.movie_id', $movieIds)
                ->findAll();
---
SELECT `pelicula_generos`.`movie_id`, `generos`.`nombre`, `generos`.`slug`
FROM `pelicula_generos`
JOIN `generos` ON `generos`.`genero_id` = `pelicula_generos`.`genero_id`
WHERE `pelicula_generos`.`movie_id` IN ('10','7','8','9','3','6','4')