app/Controllers/Admin_controllers/Series_controller.php

SELECT COUNT(*) AS `numrows`
FROM `series`
SELECT `serie_id`, `titulo`, `año_inicio`, `año_fin`, `poster`, `temporadas`, `valoracion`, `estado`, `activa`
FROM `series`
ORDER BY `titulo` ASC
 LIMIT 15
SELECT COUNT(*) AS `numrows` FROM `series`
---
    public function list_series()
    {

        //** traemos la info de las series */

        $seriesPage = $this->request->getVar('series_page') ?? 1;
        $seriesPerPage = 15;
        $serieFilter = $this->request->getVar('series_filter') ?? 'title';
        $serieDirection = $this->request->getVar('series_direction') ?? 'asc';
        $serieDirection = strtoupper($serieDirection) === 'DESC' ? 'DESC' : 'ASC';

        $seriesOrderBy = match ($serieFilter) {
            'title' => 'titulo',
            'release' => 'año_inicio',
            'rating' => 'valoracion',
            default => 'titulo'
        };

        $series = $this->serieModel
            ->select('serie_id, titulo, año_inicio, año_fin, poster, temporadas, valoracion, estado, activa')
            ->orderBy($seriesOrderBy, $serieDirection)
            ->paginate($seriesPerPage, 'series', $seriesPage);

        $seriesTotal = $this->serieModel->countAll();

SELECT `serie_generos`.`serie_id`, `generos`.`nombre`, `generos`.`slug`
FROM `serie_generos`
JOIN `generos` ON `generos`.`genero_id` = `serie_generos`.`genero_id`
WHERE `serie_generos`.`serie_id` IN ('2','4','1','5','3')
---
        $serieIds = array_column($series, 'serie_id');
        $generoPorSerie = [];
        if (!empty($serieIds)) {
            $generos = $this->serieGeneroModel
                ->select('serie_generos.serie_id, generos.nombre, generos.slug')
                ->join('generos', 'generos.genero_id = serie_generos.genero_id')
                ->whereIn('serie_generos.serie_id', $serieIds)
                ->findAll();

SELECT *
FROM `series`
WHERE `series`.`serie_id` = '1'
SELECT `generos`.`nombre`, `generos`.`slug`
FROM `serie_generos`
JOIN `generos` ON `generos`.`genero_id` = `serie_generos`.`genero_id`
WHERE `serie_generos`.`serie_id` = '1'
SELECT *
FROM `temporadas`
WHERE `serie_id` = '1'
ORDER BY `numero_temporada` ASC
SELECT *
FROM `episodios`
WHERE `temporada_id` = '1'
ORDER BY `nro_episodio` ASC
---
    public function serie_detail($id = null)
    {
        $serie = $this->serieModel->find($id);

        $generos = $this->serieGeneroModel
            ->select('generos.nombre, generos.slug')
            ->join('generos', 'generos.genero_id = serie_generos.genero_id')
            ->where('serie_generos.serie_id', $id)
            ->findAll();

        // Obtener temporadas con episodios
        $temporadas = $this->temporadaModel
            ->where('serie_id', $id)
            ->orderBy('numero_temporada', 'ASC')
            ->findAll();

        foreach ($temporadas as &$temporada) {
            $temporada['episodios'] = $this->episodioModel
                ->where('temporada_id', $temporada['temporada_id'])
                ->orderBy('nro_episodio', 'ASC')
                ->findAll();